// alert("Привет!");
// let a = 10; // создали переменную
// alert(a); // передали в alert
// console.log(a); // Выведет в консоли
// a = 15;
// console.log(a);
// // этот код можно проверить debug`ером на сайте, во вкладке "source"
/*
Получить от пользователя два числа и вывести в диалоговое окно сумму значений,
которые ввел пользователь. Вывод должен выглядеть так:
Результат сложения чисел 5 и 2 равен 7.
*/
// const x = Number.parseInt(prompt("Введите первое число"));
// // parseInt заменили на Number.parseInt - так писать правильнее в js
// const y = Number.parseInt(prompt("Введите второе число"));
// // let заменили на const - делается в том случае, если переменные в процессе выполнения кода не переприсваиваются
// //alert("Результат сложения чисел " + x + " и " + y + " равен " + (x + y));
// alert(`Результат сложения чисел ${x} и ${y} равен ${x + y}`); // используем такой стиль при наличии переменных
// const a = Number.parseFloat(prompt("Введите первое число"));
// const b = +prompt("Введите второе число"); // можно и так написать
// const sum = a + b;
// alert(`Сумма чисел ${a} и ${b} равна ${sum}`);
// Функции==========================================================================================================
// function sayHi() {
//     alert("Привет!");
// }
// sayHi();

// function sum(num1, num2) { // параметры функции передаются так
//     return num1 + num2;
// }
// alert(`Результатом выражения ${a} + ${b} = ${sum(a, b)}`);
// Задача 2 =========================================================================================================
/*
Вывести на экран в диалоговом окне текст с сообщением "Вам хорошо живется?" и кнопками "ОК", "Отмена", 
для чего необходимо использовать confirm. При нажатии на кнопку "ОК" вывести в диалоговом окне текст с
сообщением "Тогда мы идем к вам!". При нажатии на кнопку "отмена" вывести в диалоговом окне текст с 
сообщением "Ну вы держитесь там!". 
*/

// const value = confirm("Вам хорошо живется?");
// if (value) {
//     alert("Тогда мы идем к вам!");
// } else {
//     alert("Ну вы держитесь там!");
// }
// value ? alert("Тогда мы идем к вам!") : alert("Ну вы держитесь там!"); // Можно записать и так коротко
// Задача 3 =========================================================================================================
// let product = prompt("Введите продукт (Бананы, Мандарины, Груши)");
// switch (product) {
//     case "Мандарины": 
//         alert("Мандарины стоят 100 рую/кг.");
//         break;
//     case "Бананы": 
//         alert("Бананы стоят 70 рую/кг.");
//         break;
//     case "Груши": 
//         alert("Груши стоят 70 рую/кг.");
//         break;
//     default: 
//         alert("Нет такого продукта");
//         break;
// }
// Задача 5 ========================================================================================================
// Написать функцию, которая принимает имя пользователя при ее вызове и выводит сообщение с приветствием
// пользователя по имени в консоль. Проверить работоспособность функции.

function getName(){
    const name = prompt("Введите имя пользователя: ");
    console.log(`Привет ${name}`);
}
getName();